InformationRegisters/СоответствиеНастроекИнтеграцииПлатежныеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииПлатежныеСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНастроекИнтеграцииИнтернетЭквайринг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииИнтернетЭквайринг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКИнтернетЭквайрингу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыОплатОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОплатОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБанковскойКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияУдерживаетсяОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСПоКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаОперацийОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентБанковскойКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияСПлатежнымиСистемамиБП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СоздатьОперациюПоПлатежнойКарте(ДокументОснование, НастройкаПодключения, РезультатОбработки, ПараметрыФискализации = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат; // Загружаются платежи только по имеющимся в базе счетам.
	КонецЕсли; 
	
	// БИП всегда приводит даты операций к UTC. Приведем дату обратно к локальному часовому поясу.
	ДатаОперацииВUTC = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		РезультатОбработки.ПараметрыОперации, "ДатаОперации");
	ДатаОперации  = ЛокальнаяДатаСоСмещениемПоЧасовомуПоясу(ДатаОперацииВUTC);
	СуммаОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОбработки.ПараметрыОперации, "СуммаОперации");
	ИдентификаторПлатежа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОбработки.ПараметрыОперации, "ИдентификаторОперации");
		
	Если ТипЗнч(НастройкаПодключения) = Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам") Тогда
		РегистрНастроек = РегистрыСведений.СоответствиеНастроекИнтеграцииПлатежныеСистемы;
	ИначеЕсли ТипЗнч(НастройкаПодключения) = Тип("СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу") Тогда
		РегистрНастроек = РегистрыСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг;
	ИначеЕсли ТипЗнч(НастройкаПодключения) = Тип("СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей") Тогда
		ЭтоСБПb2b = НастройкаПодключения.ВариантНастройки = Перечисления.ВариантыНастройкиСБП.b2b;
		Если ЭтоСБПb2b Тогда
			РегистрНастроек = РегистрыСведений.СоответствиеНастроекИнтеграцииСБПb2b;
		Иначе
			РегистрНастроек = РегистрыСведений.СоответствиеНастроекИнтеграции;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторПлатежа)
			И НЕ РезультатОбработки.ПараметрыОперации.Свойство("ИдентификаторОперации") Тогда
			ИдентификаторПлатежа = ИдентификаторПлатежаИзОперацииСБП(ДокументОснование, ЭтоСБПb2b);
		КонецЕсли;
	КонецЕсли;
	
	Настройки = РегистрНастроек.НастройкиТорговойТочки(НастройкаПодключения);
	
	ДанныеЗаполнения = Новый Структура("ВидОперации", Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя);
	ДанныеЗаполнения.Вставить("ВидОплаты", 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ВидОплаты", Справочники.ВидыОплатОрганизаций.ОплатаКартойПоУмолчанию(Настройки.Организация)));
	
	ЭтоНовый = Ложь;
	ДокументОплатыСсылка = ДокументОплатыПоИдентификатору(ИдентификаторПлатежа);
	Если ЗначениеЗаполнено(ДокументОплатыСсылка) Тогда
		ДокументОплаты = ДокументОплатыСсылка.ПолучитьОбъект();
	Иначе
		ДокументОплаты = Документы.ОплатаПлатежнойКартой.СоздатьДокумент();
		ЭтоНовый = Истина;
	КонецЕсли;
	
	ДанныеСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,
		"СуммаДокумента, ВалютаДокумента, Дата, Номер");
	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ПроверитьЗаполнениеСуммы = ДанныеСчета.СуммаДокумента <> СуммаОперации;
	Если ЗначениеЗаполнено(СуммаОперации) И ПроверитьЗаполнениеСуммы
		И ДанныеСчета.ВалютаДокумента = ВалютаРеглУчета Тогда
		ДанныеОплаты = Новый Структура;
		ДанныеОплаты.Вставить("Основание",     ДокументОснование);
		ДанныеОплаты.Вставить("СуммаОперации", СуммаОперации);
		ДокументОплаты.Заполнить(ДанныеОплаты);
	Иначе
		ДокументОплаты.Заполнить(ДокументОснование);
	КонецЕсли;
	
	ДокументОплаты.ВидОперации = ДанныеЗаполнения.ВидОперации;
	
	Если ЭтоНовый Тогда
		Если ЗначениеЗаполнено(ДатаОперации) Тогда
			ДокументОплаты.Дата = ДатаОперации;
		Иначе
			ДокументОплаты.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним, Истина);
		КонецЕсли;
	КонецЕсли;
	
	ВидОплаты = ДанныеЗаполнения.ВидОплаты;
	Если Не ЗначениеЗаполнено(ВидОплаты) Тогда
		БанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "СтруктурнаяЕдиница");
		Банк           = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Банк");
		ВидОплаты      = ПолучитьВидОплаты(ДокументОплаты.Организация, Банк);
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидОплаты",      ВидОплаты);
	ДанныеЗаполнения.Вставить("СсылочныйНомер", ИдентификаторПлатежа);
	
	ЗаполнитьЗначенияСвойств(ДокументОплаты, ДанныеЗаполнения);
	
	ВидОплатыРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументОплаты.ВидОплаты, "Контрагент, ДоговорКонтрагента, СчетУчетаРасчетов");
	ДокументОплаты.СчетКасса         = ВидОплатыРеквизиты.СчетУчетаРасчетов;
	ДокументОплаты.Эквайер           = ВидОплатыРеквизиты.Контрагент;
	ДокументОплаты.ДоговорЭквайринга = ВидОплатыРеквизиты.ДоговорКонтрагента;
	
	УстановитьДоговорКонтрагента(ДокументОплаты);
	
	Попытка
		ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияСПлатежнымиСистемамиБП.СоздатьОперациюПоПлатежнойКарте'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ИнтеграцияСПлатежнымиСистемамиБП,
			,
			НСтр("ru = 'Ошибка проведения документа ""Оплата платежной картой"" при загрузке операций из платежных систем'",
				ОбщегоНазначения.КодОсновногоЯзыка()));
			
		ДокументОплаты.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		ДокументОплаты.Записать();
	КонецПопытки; 
	
	ИдентификаторУстройства = Неопределено;
	ОснованиеПечатиЧека = ДокументОплаты.Ссылка;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФискализации, "СтатусОперации", "Ошибка") <> "Ошибка" Тогда
		// фискализация выполнена в сервисе, пробитие чека в программе не требуется
		ПараметрыФискализации.ДокументОперации = ОснованиеПечатиЧека;
		
	ИначеЕсли ОблачныеКассы.ПробитиеЧековДоступно()
		И НЕ ПечатьФискальныхДокументовВызовСервера.ЕстьФискальныеОперацииПоДокументу(ОснованиеПечатиЧека) Тогда
	
		ИдентификаторУстройства = МенеджерОборудованияБП.ОблачнаяКассаДляАвтоматическогоПробитияЧеков(ДокументОплаты.Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
	
		ПараметрыУстройства = МенеджерОборудованияВызовСервера.ДанныеУстройства(ИдентификаторУстройства);
		
		МассивЧеков = ПечатьФискальныхДокументов.СобратьДанныеЧеков(ОснованиеПечатиЧека);
		Если МассивЧеков.Количество() = 1 Тогда  
			ФискальнаяОперация = МассивЧеков[0];
			ФискальнаяОперация.ОблачнаяККТ = Истина;
			ПечатьФискальныхДокументовВызовСервера.ДобавитьЧекВОчередьЧековККТ(ФискальнаяОперация, ИдентификаторУстройства);
		КонецЕсли;
	КонецЕсли;
	
	ПробиватьЧекиНПД = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ПробиватьЧеки", Ложь);
	СформироватьЧекНПД = ПробиватьЧекиНПД
		И ДокументОплаты.Проведен
		И ЧекиНПДВызовСервера.ВключенаИнтеграцияСПлатформойСамозанятые()
		И ИнтеграцияСПлатформойСамозанятыеВызовСервера.ПриложениеПодключено(ДокументОплаты.Организация);
	Если СформироватьЧекНПД Тогда
		ПараметрыФормированияЧекаНПД = ЧекиНПД.ПараметрыФормированияЧека(ДокументОплаты.Ссылка, ДокументОплаты.Организация);
		ПараметрыФормированияЧекаНПД.АвтоматическаяФискализация = Истина;
		ПараметрыФормированияЧекаНПД.ОтправлятьEmail =
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ОтправлятьEmail", Ложь);
		ПараметрыФормированияЧекаНПД.ОтправлятьSMS =
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ОтправлятьSMS", Ложь);
		ФоновыеЗадания.Выполнить("ЧекиНПД.СформироватьЧекАвтоматически",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыФормированияЧекаНПД));
	КонецЕсли;
	
	Если ПроверитьЗаполнениеСуммы И ДанныеСчета.СуммаДокумента = ДокументОплаты.СуммаДокумента Тогда
		// Покупатель оплатил сумму, отличную от суммы счета, но заполнить документ оплаты этой суммой не вышло
		// и сейчас документ оплаты заполнен суммой счета, а не оплаченной суммой.
		// Это могло произойти по разным причинам, например:
		//  - не совпадение валюты оплаты и валюты счета на оплату
		//  - разными ставками НДС в счете на оплату
		МассивВалют = Новый Массив;
		МассивВалют.Добавить(ДанныеСчета.ВалютаДокумента);
		МассивВалют.Добавить(ДокументОплаты.ВалютаДокумента);
		НаименованияВалют = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивВалют, "Наименование");
		СуммаСчетаПрописью =
			Формат(ДанныеСчета.СуммаДокумента, "ЧДЦ=2") + " " + НаименованияВалют[ДанныеСчета.ВалютаДокумента].Наименование;
		СуммаОперацииПрописью =
			Формат(СуммаОперации, "ЧДЦ=2") + " " + НаименованияВалют[ДокументОплаты.ВалютаДокумента].Наименование;
		ШаблонОшибки =
			НСтр("ru = 'Сумма оплаты %1 из платежной системы не совпадает с суммой %2 по счету №%3 от %4.
				|В документ установлена сумма из счета'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки,
			СуммаОперацииПрописью,
			СуммаСчетаПрописью,
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеСчета.Номер, Истина, Ложь),
			Формат(ДанныеСчета.Дата, "ДЛФ=D"));
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИнтеграцияСПлатежнымиСистемамиБП.СоздатьОперациюПоПлатежнойКарте'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.ОплатаПлатежнойКартой,
			ДокументОплаты.Ссылка,
			ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВозвратОплаты(ПараметрыПроцедуры, АдресРезультата) Экспорт

	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументВозврата);
	
	ДокументНаВозврат = Неопределено;
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.ДокументВозврата) Тогда
		ДокументНаВозврат = Новый Структура("ДатаВозврата, СуммаВозврата");
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПараметрыПроцедуры.ДокументВозврата, "СуммаДокумента, Дата");
		ДокументНаВозврат.СуммаВозврата = РеквизитыДокумента.СуммаДокумента;
		ДокументНаВозврат.ДатаВозврата  = РеквизитыДокумента.Дата;
	КонецЕсли;
	
	Если ПараметрыПроцедуры.СпособОплатыОнлайнЗаказы = "Эквайринг" Тогда
		РезультатОперации = ИнтернетЭквайринг.ВозвратОплаты(
			ПараметрыПроцедуры.ДокументВозврата,
			ПараметрыПроцедуры.ДокументОплаты,
			ПараметрыПроцедуры.НастройкаИнтеграции);
	Иначе
		РезультатОперации = ПлатежныеСистемы.ВозвратОплаты(
			ПараметрыПроцедуры.ДокументВозврата,
			ПараметрыПроцедуры.ДокументОплаты,
			ПараметрыПроцедуры.НастройкаИнтеграции);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);

КонецПроцедуры

Функция НазначениеПлатежа(ШаблонНазначения, ДанныеДокумента) Экспорт
	НазначениеПлатежа = "";
	
	ОрганизацияНаименование = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
		ДанныеДокумента.Организация).НаименованиеДляПечатныхФорм;
	
	Если ШаблонНазначения = Неопределено Тогда
		Если ДанныеДокумента.Свойство("СуммаНДС") И ЗначениеЗаполнено(ДанныеДокумента.СуммаНДС) Тогда
			НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата через СБП по счету № %1 от %2. Сумма %3, в т.ч. НДС %4.'"),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер, Истина, Ложь),
				Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"),
				Формат(ДанныеДокумента.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="),
				Формат(ДанныеДокумента.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		Иначе
			НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата через СБП по счету № %1 от %2. Сумма %3.'"),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер, Истина, Ложь),
				Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"),
				Формат(ДанныеДокумента.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		КонецЕсли;
	Иначе
		НазначениеПлатежа = СтрЗаменить(
			ШаблонНазначения.НазначениеПлатежа,
			"[НаименованиеОрганизации]",
			ОрганизацияНаименование);
		НазначениеПлатежа = СтрЗаменить(
			НазначениеПлатежа,
			"[НомерСчета]",
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер, Истина, Ложь));
		НазначениеПлатежа = СтрЗаменить(
			НазначениеПлатежа,
			"[ДатаСчета]",
			Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"));
		НазначениеПлатежа = СтрЗаменить(
			НазначениеПлатежа,
			"[СуммаСчета]",
			Формат(ДанныеДокумента.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		Если ДанныеДокумента.Свойство("СуммаНДС") И ЗначениеЗаполнено(ДанныеДокумента.СуммаНДС) Тогда
			НазначениеПлатежа = СтрЗаменить(
				НазначениеПлатежа,
				"[НДС]",
				Формат(ДанныеДокумента.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		КонецЕсли;
	КонецЕсли; 
	
	Возврат НазначениеПлатежа;
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ПередВыполнениемОперацииВПлатежнойСистеме(ДокументОперации)
	
	Если ТипЗнч(ДокументОперации) <> Тип("ДокументСсылка.СчетНаОплатуПокупателю")
		И ТипЗнч(ДокументОперации) <> Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		ВызватьИсключение НСтр("ru = 'Оплата в платежной системе для документа не поддерживается.'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОперации) Тогда
		ВызватьИсключение НСтр("ru = 'Перед выполнением оплаты запишите документ.'")
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументОплатыПоИдентификатору(ИдентификаторПлатежа)
	
	Результат = Неопределено;
	Если Не ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылочныйНомер", ИдентификаторПлатежа);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОплатаПлатежнойКартой.Ссылка КАК Ссылка,
	|	ОплатаПлатежнойКартой.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.СсылочныйНомер = &СсылочныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует дату в UTC в дату локальную дату со смещением по часовому поясу.
//
// Параметры:
//  Значение - Дата - исходная дата.
//
// Возвращаемое значение:
//  Дата - результат преобразования.
//
Функция ЛокальнаяДатаСоСмещениемПоЧасовомуПоясу(ДатаВUTC) Экспорт
	
	Возврат ДатаВUTC + СмещениеСтандартногоВремени(ЧасовойПоясСеанса(), ДатаВUTC);
	
КонецФункции  

// Возвращает ссылку на вид оплаты по расчетам с банком.
// Выбирается вид оплаты с контрагентом, ИНН которого соответствует ИНН банка-эквайера.
// Если подоходящий вид оплаты не найден, он создается с данными банка-эквайера,
// если включена соответствующая настройка.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация для поиска (создания) вида оплаты.
//  УчастникСБП - Структура, СправочникСсылка.Банки - Банк-эквайер или данные платежного агрегатора
//                                                    для поиска (создания) вида оплаты.
//  СоздаватьНовыеЭлементы - Булево - создавать Вид оплаты (и контрагента), если не найдены. По умолчанию Ложь.
//
// Возвращаемое значение:
//   СправочникСсылка.ВидыОплатОрганизаций - Вид оплаты.
//
Функция ПолучитьВидОплаты(Организация, УчастникСБП, СоздаватьНовыеЭлементы = Ложь)
	
	ДанныеБанка = РаботаСБанкамиБП.ПолучитьДанныеКонтрагентаБанка(УчастникСБП, СоздаватьНовыеЭлементы);
	Контрагент  = ДанныеБанка.Ссылка;
	Договор     = РаботаСБанкамиБП.ДоговорКонтрагентБанка(Организация, Контрагент, СоздаватьНовыеЭлементы);
	ВидОплаты   = НайтиВидОплаты(Организация, Контрагент);
	Если СоздаватьНовыеЭлементы И Не ЗначениеЗаполнено(ВидОплаты) Тогда
		ВидОплаты = СоздатьВидОплаты(Организация, Контрагент, Договор, ДанныеБанка.Наименование);
	КонецЕсли;
	
	Возврат ВидОплаты;
	
КонецФункции 

Функция НайтиВидОплаты(Организация, Контрагент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ВидыОплатОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
	|ГДЕ
	|	ВидыОплатОрганизаций.Контрагент = &Контрагент
	|	И ВидыОплатОрганизаций.Организация = &Организация
	|	И НЕ ВидыОплатОрганизаций.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Возвращаем найденный вид оплаты, только если он один.
	Если Выборка.Количество() > 1 Тогда
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция СоздатьВидОплаты(Организация, Контрагент, Договор, Наименование)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ТипОплаты",   Перечисления.ТипыОплат.СБП);
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Контрагент",  Контрагент);
	
	ВидОплаты = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
	ВидОплаты.Заполнить(ДанныеЗаполнения);
	ВидОплаты.ДоговорКонтрагента = Договор;
	ВидОплаты.Наименование = СтрШаблон(НСтр("ru = 'СБП с %1'"), Наименование);
	
	Попытка
		ВидОплаты.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ИнтеграцияССБПБП.НайтиИлиСоздатьВидОплаты'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ИнтеграцияССБПБП,
			,
			НСтр("ru = 'Ошибка создания вида оплаты при настройке интеграции с СБП'",
				ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецПопытки;
	
	Возврат ВидОплаты.Ссылка;
	
КонецФункции

Процедура УстановитьДоговорКонтрагента(Объект)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРасшифровки = Объект.РасшифровкаПлатежа[0];
	
	ПараметрыПлатежа = Новый Структура;
	ПараметрыПлатежа.Вставить("ОплатаВВалюте", Новый Структура("ЗначениеОтбора", Ложь));
	ВидыДоговоров = РаботаСДоговорамиКонтрагентовБПВызовСервера.ВидыДоговоровДокумента(
		Объект.ВидОперации, ТипЗнч(Объект.Ссылка));
	
	Если ЗначениеЗаполнено(СтрокаРасшифровки.ДоговорКонтрагента) Тогда
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасшифровки.ДоговорКонтрагента, "ВидДоговора");
		Если ВидыДоговоров.Найти(ВидДоговора) = Неопределено Тогда
			СтрокаРасшифровки.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		СтрокаРасшифровки.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация, ВидыДоговоров, ПараметрыПлатежа);
	
	Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		СтрокаРасшифровки.ДоговорКонтрагента = РаботаСБанкамиБП.ДоговорКонтрагентБанка(Объект.Организация, Объект.Контрагент, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторПлатежаИзОперацииСБП(ДокументОперации, ЭтоСБПb2b)
	ИдентификаторПлатежа = "";
	
	Если ЭтоСБПb2b Тогда
		Операции = ПереводыСБПb2b.ОперацииПоДокументу(ДокументОперации);
	Иначе
		Операции = ПереводыСБПc2b.ОперацииПоДокументу(ДокументОперации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Операции.ДанныеОпераций) Тогда
		ОперацияСБП = Операции.ДанныеОпераций[0];
		ИдентификаторПлатежа = ОперацияСБП.ИдентификаторОперации;
	КонецЕсли;
	
	Возврат ИдентификаторПлатежа;
КонецФункции

#КонецОбласти
